BSP_EDT/src/InformationRegisters/Спец_ПараметрыОбменовСДругимиБазами/Спец_ПараметрыОбменовСДругимиБазами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_ПараметрыОбменовСДругимиБазами</name>
  <resources>
    <name>ОбменВключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяОбъектаМетаданныхПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВызыватьЗаписьПринудительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмяРеквизитаДляПроверкиВКлючевыхОбъектах</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИскатьОбъектыБезУчетаПустогоГУИДа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсправлятьГУИДыОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОбменаДляПолногоОбновления</name>
    <type>
      <types>EnumRef.Спец_ПериодыОбменаДляОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>ПисатьНапрямуюВБД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПропуститьРегистрациюУдаленныхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрироватьСОбменомДанными</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОбмена</name>
    <type>
      <types>EnumRef.Спец_ТипыОбменовСДругимиБазами</types>
    </type>
  </resources>
  <resources>
    <name>ТипПередачи</name>
    <type>
      <types>EnumRef.Спец_ТипыПередачиОбъектовДляОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ТолькоПолучатьГУИД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТолькоСоздаватьВБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоБольшаяТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоследнегоПолногоОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейПроверкиГУИДов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляПолученияОбъектов_Отправитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляПолученияОбъектов_Получатель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИсключения_Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаИсключения_Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстыЗапросовДляЗаписиНапрямую</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстыЗапросовДляПолногоОбновленияНапрямую</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПолногоСравнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмяОбъектаМетаданныхИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BSP_EDT/src/CommonModules/Спец_ОбменСДругимиБазамиНаВремяВызоваПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

Функция ПолучитьСтруктуруПараметровДляПроверкиУОтправителя(Знач ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ПараметрыОбменовСДругимиБазами.База КАК База,
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхИсточник КАК ПолноеИмяОбъектаМетаданныхИсточник,
	|	ПараметрыОбменовСДругимиБазами.РегистрироватьСОбменомДанными КАК РегистрироватьСОбменомДанными,
	|	ПараметрыОбменовСДругимиБазами.ИмяРеквизитаДляПроверкиВКлючевыхОбъектах КАК ИмяРеквизитаДляПроверкиВКлючевыхОбъектах,
	|	ПараметрыОбменовСДругимиБазами.ТекстЗапросаИсключения_Отправитель КАК ТекстЗапросаИсключения_Отправитель
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	РегистрСведений.Спец_ПараметрыОбменовСДругимиБазами КАК ПараметрыОбменовСДругимиБазами
	|ГДЕ
	|	ПараметрыОбменовСДругимиБазами.ПолноеИмяОбъектаМетаданныхИсточник = &ПолноеИмяОбъектаМетаданныхИсточник
	|	И ПараметрыОбменовСДругимиБазами.ОбменВключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.База КАК База,
	|	втРезультат.РегистрироватьСОбменомДанными КАК РегистрироватьСОбменомДанными,
	|	втРезультат.ИмяРеквизитаДляПроверкиВКлючевыхОбъектах КАК ИмяРеквизитаДляПроверкиВКлючевыхОбъектах,
	|	втРезультат.ТекстЗапросаИсключения_Отправитель КАК ТекстЗапросаИсключения_Отправитель
	|ИЗ
	|	втРезультат КАК втРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеОбъектовДляОбмена.База КАК База,
	|	СоответствиеОбъектовДляОбмена.ИмяТабличнойЧастиИсточник КАК ИмяТабличнойЧастиИсточник,
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаИсточник КАК ИмяРеквизитаИсточник
	|ИЗ
	|	РегистрСведений.Спец_СоответствиеОбъектовДляОбмена КАК СоответствиеОбъектовДляОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРезультат КАК втРезультат
	|		ПО СоответствиеОбъектовДляОбмена.База = втРезультат.База
	|		И СоответствиеОбъектовДляОбмена.ИмяОбъектаМетаданныхИсточник = втРезультат.ПолноеИмяОбъектаМетаданныхИсточник
	|ГДЕ
	|	СоответствиеОбъектовДляОбмена.ИмяРеквизитаПриемник <> """"";
	
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданныхИсточник", ПолноеИмяМетаданных);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	ВГраница       = ПакетыЗапросов.ВГраница();
	
	ТаблицаСоответствиеОбъектов = ПакетыЗапросов[ВГраница].Выгрузить();
	ТаблицаСоответствиеОбъектов.Индексы.Добавить("База, ИмяТабличнойЧастиИсточник, ИмяРеквизитаИсточник");
	
	ТаблицаРезультат = ПакетыЗапросов[ВГраница - 1].Выгрузить();
	
	Возврат Новый Структура("ТаблицаСоответствиеОбъектов, ТаблицаРезультат",
			ТаблицаСоответствиеОбъектов,
			ТаблицаРезультат);
	
КонецФункции

// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульОтправителя

// ++ Спец_БСП.ОбменСДругимиБазами_ЕстьМодульПолучателя

Функция ПолучитьМассивСтруктурДляПроверкиУПолучателя(Знач ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ОбъектыДляРегистрацииДляОбменов.База КАК База,
	|	ОбъектыДляРегистрацииДляОбменов.ПолноеИмяОбъектаМетаданных КАК ПолноеИмяОбъектаМетаданных,
	|	ОбъектыДляРегистрацииДляОбменов.ПоляДляИзменения КАК ПоляДляИзменения,
	|	ОбъектыДляРегистрацииДляОбменов.ТекстЗапросаИсключения КАК ТекстЗапросаИсключения
	|ИЗ
	|	РегистрСведений.Спец_ОбъектыДляРегистрацииДляОбменов КАК ОбъектыДляРегистрацииДляОбменов
	|ГДЕ
	|	ОбъектыДляРегистрацииДляОбменов.ПолноеИмяОбъектаМетаданных = &ПолноеИмяОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданных", ПолноеИмяМетаданных);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	МассивРезультат = Спец_ОбщегоНазначения.ПреобразоватьТаблицуЗначенийВМассивСтрок(ТаблицаРезультат);
	Возврат Спец_РаботаСКоллекциямиКлиентСервер.СкопироватьМассив(МассивРезультат, Истина);
	
КонецФункции

// -- Спец_БСП.ОбменСДругимиБазами_ЕстьМодульПолучателя

#КонецОбласти
